RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_vsc_regs.h
/* Bitfield definition for register: POS_POLE */
/*
 * POS_POLE (RW)
 *
 * pole number
 */
#define VSC_POS_POLE_POS_POLE_MASK (0xFFFFU)
#define VSC_POS_POLE_POS_POLE_SHIFT (0U)
#define VSC_POS_POLE_POS_POLE_SET(x) (((uint32_t)(x) << VSC_POS_POLE_POS_POLE_SHIFT) & VSC_POS_POLE_POS_POLE_MASK)
#define VSC_POS_POLE_POS_POLE_GET(x) (((uint32_t)(x) & VSC_POS_POLE_POS_POLE_MASK) >> VSC_POS_POLE_POS_POLE_SHIFT)

/* Bitfield definition for register: ID_POSEDGE */
/*
 * ID_POSEDGE (RO)
 *
 * posedge order Id value
 */
#define VSC_ID_POSEDGE_ID_POSEDGE_MASK (0xFFFFFFFFUL)
#define VSC_ID_POSEDGE_ID_POSEDGE_SHIFT (0U)
#define VSC_ID_POSEDGE_ID_POSEDGE_GET(x) (((uint32_t)(x) & VSC_ID_POSEDGE_ID_POSEDGE_MASK) >> VSC_ID_POSEDGE_ID_POSEDGE_SHIFT)

/* Bitfield definition for register: IQ_POSEDGE */
/*
 * IQ_POSEDGE (RO)
 *
 * posedge order Iq value
 */
#define VSC_IQ_POSEDGE_IQ_POSEDGE_MASK (0xFFFFFFFFUL)
#define VSC_IQ_POSEDGE_IQ_POSEDGE_SHIFT (0U)
#define VSC_IQ_POSEDGE_IQ_POSEDGE_GET(x) (((uint32_t)(x) & VSC_IQ_POSEDGE_IQ_POSEDGE_MASK) >> VSC_IQ_POSEDGE_IQ_POSEDGE_SHIFT)

/* Bitfield definition for register: ID_NEGEDGE */
/*
 * ID_NEGEDGE (RO)
 *
 * negedge order Id value
 */
#define VSC_ID_NEGEDGE_ID_NEGEDGE_MASK (0xFFFFFFFFUL)
#define VSC_ID_NEGEDGE_ID_NEGEDGE_SHIFT (0U)
#define VSC_ID_NEGEDGE_ID_NEGEDGE_GET(x) (((uint32_t)(x) & VSC_ID_NEGEDGE_ID_NEGEDGE_MASK) >> VSC_ID_NEGEDGE_ID_NEGEDGE_SHIFT)

/* Bitfield definition for register: IQ_NEGEDGE */
/*
 * IQ_NEGEDGE (RO)
 *
 * negedge order Iq value
 */
#define VSC_IQ_NEGEDGE_IQ_NEGEDGE_MASK (0xFFFFFFFFUL)
#define VSC_IQ_NEGEDGE_IQ_NEGEDGE_SHIFT (0U)
#define VSC_IQ_NEGEDGE_IQ_NEGEDGE_GET(x) (((uint32_t)(x) & VSC_IQ_NEGEDGE_IQ_NEGEDGE_MASK) >> VSC_IQ_NEGEDGE_IQ_NEGEDGE_SHIFT)

/* Bitfield definition for register: ALPHA_POSEDGE */
/*
 * ALPHA_POSEDGE (RO)
 *
 * posedge order alpha value
 */
#define VSC_ALPHA_POSEDGE_ALPHA_POSEDGE_MASK (0xFFFFFFFFUL)
#define VSC_ALPHA_POSEDGE_ALPHA_POSEDGE_SHIFT (0U)
#define VSC_ALPHA_POSEDGE_ALPHA_POSEDGE_GET(x) (((uint32_t)(x) & VSC_ALPHA_POSEDGE_ALPHA_POSEDGE_MASK) >> VSC_ALPHA_POSEDGE_ALPHA_POSEDGE_SHIFT)

/* Bitfield definition for register: BETA_POSEDGE */
/*
 * BETA_POSEDGE (RO)
 *
 * posedge order beta value
 */
#define VSC_BETA_POSEDGE_BETA_POSEDGE_MASK (0xFFFFFFFFUL)
#define VSC_BETA_POSEDGE_BETA_POSEDGE_SHIFT (0U)
#define VSC_BETA_POSEDGE_BETA_POSEDGE_GET(x) (((uint32_t)(x) & VSC_BETA_POSEDGE_BETA_POSEDGE_MASK) >> VSC_BETA_POSEDGE_BETA_POSEDGE_SHIFT)

/* Bitfield definition for register: ALPHA_NEGEDGE */
/*
 * ALPHA_NEGEDGE (RO)
 *
 * negedge order alpha value
 */
#define VSC_ALPHA_NEGEDGE_ALPHA_NEGEDGE_MASK (0xFFFFFFFFUL)
#define VSC_ALPHA_NEGEDGE_ALPHA_NEGEDGE_SHIFT (0U)
#define VSC_ALPHA_NEGEDGE_ALPHA_NEGEDGE_GET(x) (((uint32_t)(x) & VSC_ALPHA_NEGEDGE_ALPHA_NEGEDGE_MASK) >> VSC_ALPHA_NEGEDGE_ALPHA_NEGEDGE_SHIFT)

/* Bitfield definition for register: BETA_NEGEDGE */
/*
 * BETA_NEGEDGE (RO)
 *
 * negedge order beta value
 */
#define VSC_BETA_NEGEDGE_BETA_NEGEDGE_MASK (0xFFFFFFFFUL)
#define VSC_BETA_NEGEDGE_BETA_NEGEDGE_SHIFT (0U)
#define VSC_BETA_NEGEDGE_BETA_NEGEDGE_GET(x) (((uint32_t)(x) & VSC_BETA_NEGEDGE_BETA_NEGEDGE_MASK) >> VSC_BETA_NEGEDGE_BETA_NEGEDGE_SHIFT)

/* Bitfield definition for register: TIMESTAMP_LOCKED */
/*
 * TIMESTAMP_LOCKED (RO)
 *
 * timestamp_locked
 */
#define VSC_TIMESTAMP_LOCKED_TIMESTAMP_LOCKED_MASK (0xFFFFFFFFUL)
#define VSC_TIMESTAMP_LOCKED_TIMESTAMP_LOCKED_SHIFT (0U)
#define VSC_TIMESTAMP_LOCKED_TIMESTAMP_LOCKED_GET(x) (((uint32_t)(x) & VSC_TIMESTAMP_LOCKED_TIMESTAMP_LOCKED_MASK) >> VSC_TIMESTAMP_LOCKED_TIMESTAMP_LOCKED_SHIFT)

/* Bitfield definition for register: DEBUG_STATUS0 */
/*
 * VALUE_A_COUNTER (RO)
 *
 * value_a_counter
 */
#define VSC_DEBUG_STATUS0_VALUE_A_COUNTER_MASK (0xF00U)
#define VSC_DEBUG_STATUS0_VALUE_A_COUNTER_SHIFT (8U)
#define VSC_DEBUG_STATUS0_VALUE_A_COUNTER_GET(x) (((uint32_t)(x) & VSC_DEBUG_STATUS0_VALUE_A_COUNTER_MASK) >> VSC_DEBUG_STATUS0_VALUE_A_COUNTER_SHIFT)

/*
 * VALUE_B_COUNTER (RO)
 *
 * value_b_counter
 */
#define VSC_DEBUG_STATUS0_VALUE_B_COUNTER_MASK (0xF0U)
#define VSC_DEBUG_STATUS0_VALUE_B_COUNTER_SHIFT (4U)
#define VSC_DEBUG_STATUS0_VALUE_B_COUNTER_GET(x) (((uint32_t)(x) & VSC_DEBUG_STATUS0_VALUE_B_COUNTER_MASK) >> VSC_DEBUG_STATUS0_VALUE_B_COUNTER_SHIFT)

/*
 * VALUE_C_COUNTER (RO)
 *
 * value_c_counter
 */
#define VSC_DEBUG_STATUS0_VALUE_C_COUNTER_MASK (0xFU)
#define VSC_DEBUG_STATUS0_VALUE_C_COUNTER_SHIFT (0U)
#define VSC_DEBUG_STATUS0_VALUE_C_COUNTER_GET(x) (((uint32_t)(x) & VSC_DEBUG_STATUS0_VALUE_C_COUNTER_MASK) >> VSC_DEBUG_STATUS0_VALUE_C_COUNTER_SHIFT)




#endif /* HPM_VSC_H */
